Revit 2018 API
EnergyDataSettings.CheckRangeOfMassZoneCoreOffset Method
 Checks that the mass zone core offset is greater than or equal to zero.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This api is obsolete and will be removed in a future version of Revit. Use CheckRangeOfCoreOffset instead.")]
public static bool CheckRangeOfMassZoneCoreOffset(
	double massZoneCoreOffset
)
Visual Basic
<ObsoleteAttribute("This api is obsolete and will be removed in a future version of Revit. Use CheckRangeOfCoreOffset instead.")> _
Public Shared Function CheckRangeOfMassZoneCoreOffset ( _
	massZoneCoreOffset As Double _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This api is obsolete and will be removed in a future version of Revit. Use CheckRangeOfCoreOffset instead.")]
public:
static bool CheckRangeOfMassZoneCoreOffset(
	double massZoneCoreOffset
)
Parameters
massZoneCoreOffset
Type: System.Double
 The mass zone core offset to be checked. Should be greater than or equal to zero.
Return Value
 True if the mass zone core offset is greater than or equal to zero, false otherwise.
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace